import React from "react";
import "./Companies.css";
// import logo1 from '../assets/'
import logo1 from "../assets/productsData/company.jpg"
import Navbar from "../components/Navbar";
import Footer from "../components/Footer";
import BlueCards from "../components/BlueCards";
import AIChatBot from "../components/AIchatbot";

const companies = [
    {
        title: "العربية للجبس",
        desc: `"العربية للجبس" هي إحدى الشركات الرائدة في مجال إنتاج وتوريد منتجات ألواح الجبس والأسقف الجبسية وأنظمة تركيبها عالية الجودة."العربية للجبس" هي إحدى الشركات الرائدة في مجال إنتاج وتوريد منتجات ألواح الجبس والأسقف الجبسية وأنظمة تركيبها عالية الجودة."العربية للجبس" هي إحدى الشركات الرائدة في مجال إنتاج وتوريد منتجات ألواح الجبس والأسقف الجبسية وأنظمة تركيبها عالية الجودة.`,
    },
    {
        title: "العربية للكهرباء",
        desc: `متخصصة في تقديم الحلول الكهربائية المتكاملة، وتقدم الشركة منتجات وخدمات عالية الكفاءة متخصصة في تقديم الحلول الكهربائية المتكاملة، وتقدم الشركة منتجات وخدمات عالية الكفاءةمتخصصة في تقديم الحلول الكهربائية المتكاملة، وتقدم الشركة منتجات وخدمات عالية الكفاءةمتخصصة في تقديم الحلول الكهربائية المتكاملة، وتقدم الشركة منتجات وخدمات عالية الكفاءة`,
    },
    {
        title: "العربية للرخام",
        desc: `الرخام نعم رائد في مجال التهجئة في تركيب أطراف القشرة الرخامية في نيتريل ستون تقدم مجموعة واسعة من الخيارات لتلبية احتياجات مشاريع التصميم الداخلي والخارجي الرخام نعم رائد في مجال التهجئة في تركيب أطراف القشرة الرخامية في نيتريل ستون تقدم مجموعة واسعة من الخيارات لتلبية احتياجات مشاريع التصميم الداخلي والخارجي`,
    },
    {
        title: "العربية للتكييف",
        desc: `تسعى شركة العربية لتكييف الهواء إلى توفير حلول تكييف الهواء الفعالة والصديقة للبيئة والتي تلبي احتياجات المنازل والمشاريع التجارية والمرافق الصناعية. تسعى شركة العربية لتكييف الهواء إلى توفير حلول تكييف الهواء الفعالة والصديقة للبيئة والتي تلبي احتياجات المنازل والمشاريع التجارية والمرافق الصناعية.`,
    },
    {
        title: "العربية لتقنية المعلومات",
        desc: `تهدف شركة "العربية لتقنية المعلومات" إلى دعم التحول الرقمي في المملكة من خلال "توفير" خدمات تكنولوجية حديثة وحلول رقمية متقدمة للشركات والمؤسسات تهدف شركة "العربية لتقنية المعلومات" إلى دعم التحول الرقمي في المملكة من خلال "توفير" خدمات تكنولوجية حديثة وحلول رقمية متقدمة للشركات والمؤسسات`,
    },
];

const Companies = () => {
    return (
        <div className="companies-container">
            <div className="comp_hero">
                <Navbar />
                <h2 className="companies-title">
                    الشركات <span>التابعة</span>
                </h2>
                <p className="companies-subtitle">
                    تنضوي تحت مظلة "شركة العربية للاستثمار" خمس شركات متخصصة تعمل كل منها على تحقيق الجودة والكفاءة في مجالها وتلبية احتياجات السوق السعودي بمستوى عال من الاحترافية
                </p>
            </div>


            {companies.map((company, index) => (
                <div key={index} className="company-section">
                    <div className={`company-box ${index % 2 === 0 ? "right" : "left"}`}>
                        <div className="image-placeholder">
                            <img src={logo1} alt="" />
                        </div>

                        <div className="text">
                            <h3>{company.title}</h3>
                            <p>{company.desc}</p>
                            <a href="/about">
                                <button>تعرف على منتجاتنا</button>
                            </a>
                            
                        </div>
                    </div>
                </div>
                
            ))}

            <div className="Cards_rspnsv">
                <BlueCards />
            </div>
            <AIChatBot/>
            <Footer />
        </div>
    );
};

export default Companies;
