import img1 from "../assets/productsData/saqf.png"
const productData = {
    id: "gypsum-ceilings",
    category: "الجبس",
    title: "اسقف جبس مثقب ",
    description: `هي نوع من الأسقف الجبسية تتميز بوجود ثقوب أو أنماط مخرمة موزعة بشكل هندسي على سطح الألواح الجبسية. تُستخدم هذه الأسقف بشكل شائع في المساحات التجارية والسكنية لتحقيق مزيج من الجماليات والوظائف العملية.`,
    image: img1,
    options: {
        المصنع: ["المصنع 1", "المصنع 2"],
        الحافة: ["حافة مستقيمة", "حافة منحنية"],
        الحجم: ["60x60 سم", "120x60 سم"],
        السماكة: ["8 مم", "12 مم"]
    },
    overview: `بلاط يوازن التصميم الفريد بين الجماليات والأداء الصوتي لمساعدتك على إتمام المتطلبات الخاصة بكل مشروع بنجاح دون التضحية بأي منهما. الأسقف الجبسية المخرمة والمصنوعة من الجبس. بلاط الجبس المخرم ساوندبلوك Q9 هو بلاط مخرم بثقوب مربعة توفر جمالية رائعة وأداء صوتي ممتاز. خيار مثالي للمباني ذات الظروف الجوية القاسية، دون التاثير على الأداء الصوتي أو المظهر الجذاب المعاصر. عبارة عن مادة بناء مستدامة ومتينة، بثقوب مميزة. تم تطويرها لمجموعة واسعة من الحلول الإنشائية والتصميمية، مما يوفر الأداء والأناقة في أي مساحة. `,
   catalogs: [
  {
    id: "desc",
    title: "وصف المنتج",
 content: [
      "بلاط السقف الجبسي يحتوي على 9 ملم ثقوب مربعة وطبقة خلفية من الصوف لأداء صوتي عالي.",
      "تتوفر البلاطات بحواف مختلفة من أجل مظهر عصري وجمالي.",
      "مقاومة عالية للرطوبة والتراخي تضمن المتانة في الظروف البيئية القياسية أو القاسية.",
      "مقاومة للفرك، لتضمن سهولة إزالة الأتربة والأوساخ.",
      "متينة ومقاومة للاحتكاك والخدش، لتدوم لوقت أطول.",
      "مناسبة للمناطق ذات الرطوبة العالية.",
      "اقتصادية وسهلة القطع والتركيب."
    ]  },
  {
    id: "features",
    title: "مميزات الأسقف الجبسية",
       content: "تفاصيل الأبعاد، الوزن، الخامات والتشطيب."

  },
  {
    id: "technical",
    title: "البيانات التقنية",
    content: "تفاصيل الأبعاد، الوزن، الخامات والتشطيب."
  },
  {
    id: "installation",
    title: "إرشادات التركيب",
    content: "خطوات التركيب والتوصيات الفنية."
  }
]

};

export default productData;